//年份
var yearElement = document.getElementById('year');
var chinamap = echarts.init(document.querySelector(".mainbox .map .china"));
var mapoption = chinamap.getOption();
var myChart = echarts.init(document.getElementById('chart1'));
//种植业总产值
var zhongzhiye_p = ['西藏', '北京', '上海', '青海', '天津', '宁夏', '海南', '山西', '吉林', '甘肃', '重庆', '内蒙古', '浙江', '江西', '福建', '辽宁', '云南', '陕西', '安徽', '贵州', '新疆', '湖南', '广西', '湖北', '河北', '广东', '黑龙江', '江苏', '四川', '山东', '河南'];
var zhongzhiye = {
    2018: [88.08, 114.75, 150.09, 169.24, 197.21, 344.63, 729.51, 894.95, 992.96, 1166.1, 1292.68, 1512.5, 1517.96, 1549.22, 1653.45, 1749.41, 2234.74, 2244.96, 2253.66, 2288.71, 2541.16, 2664.3, 2717.48, 3033.76, 3085.86, 3089.57, 3634.99, 3735.02, 4153.71, 4678.26, 4973.68],
    2019: [94.9, 102.33, 145.81, 181.25, 202.91, 330.78, 819.58, 936.76, 1014.12, 1306.41, 1397.49, 1606.34, 1594.96, 1624.25, 1774.77, 1912.02, 2680.16, 2445.83, 2365.39, 2535.68, 2616.3, 3052.06, 3102.27, 3257.85, 3114.86, 3530.21, 3774.48, 3828.6, 4395.04, 4914.43, 5408.59],
    2020: [103.99, 107.57, 138.0, 188.6, 228.76, 397.91, 874.81, 1075.94, 1231.84, 1423.85, 1596.13, 1699.01, 1593.96, 1689.88, 1818.18, 2056.82, 2902.24, 2807.07, 2525.42, 2781.8, 2936.33, 3364.77, 3268.8, 3492.54, 3413.34, 3769.26, 4044.15, 4102.16, 4701.88, 5168.36, 6244.84],
    2021: [115.31, 122.98, 144.94, 204.73, 258.39, 412.7, 1049.56, 1223.14, 1302.91, 1623.21, 1759.89, 1879.55, 1697.86, 1796.31, 1906.02, 2222.54, 3441.47, 3035.65, 2802.93, 3123.71, 3488.99, 3532.87, 3690.73, 3912.47, 3645.02, 3951.14, 4099.55, 4426.06, 5089.48, 5814.56, 6564.83],
    2022: [120.95, 129.77, 149.26, 238.34, 276.8, 455.59, 1236.81, 1288.41, 1512.73, 1806.43, 1881.78, 2208.47, 1769.83, 1916.68, 2065.66, 2258.29, 3629.9, 3310.43, 2937.04, 3313.7, 3753.98, 3973.21, 3977.68, 4193.14, 4035.67, 4308.23, 4320.48, 4685.72, 5528.76, 6206.54, 6948.3],
}
//粮食产量
var liangshi_p = ['北京', '青海', '上海', '西藏', '海南', '天津', '宁夏', '福建', '浙江', '贵州', '重庆', '甘肃', '广东', '陕西', '广西', '山西', '新疆', '云南', '江西', '辽宁', '湖北', '湖南', '四川', '内蒙古', '吉林', '江苏', '河北', '安徽', '山东', '河南', '黑龙江'];
var liangshi = {
    2018: [34.14, 103.06, 103.74, 104.4, 147.12, 209.69, 392.58, 498.58, 599.14, 1059.7, 1079.34, 1151.43, 1193.49, 1226.0, 1372.8, 1380.4, 1504.23, 1860.54, 2190.7, 2192.45, 2839.47, 3022.9, 3493.7, 3553.28, 3632.74, 3660.28, 3700.86, 4007.25, 5319.51, 6648.91, 7506.8],
    2019: [28.76, 105.54, 95.89, 103.92, 144.96, 223.25, 373.15, 493.9, 592.15, 1051.24, 1075.15, 1162.58, 1240.8, 1231.13, 1332.0, 1361.8, 1527.07, 1870.03, 2157.45, 2429.95, 2724.98, 2974.84, 3498.5, 3652.54, 3877.93, 3706.2, 3739.24, 4054.0, 5357.0, 6695.36, 7503.01],
    2020: [30.53, 107.42, 91.44, 102.87, 145.47, 228.18, 380.49, 502.32, 605.7, 1057.63, 1081.42, 1202.21, 1267.56, 1274.83, 1370.02, 1424.27, 1583.4, 1895.86, 2163.88, 2338.83, 2727.43, 3015.12, 3527.43, 3664.1, 3803.17, 3729.06, 3795.89, 4019.22, 5446.81, 6825.8, 7540.78],
    2021: [37.75, 109.09, 93.96, 106.15, 146.03, 249.87, 368.44, 506.42, 620.9, 1094.86, 1092.84, 1231.46, 1279.87, 1270.43, 1386.54, 1421.25, 1735.78, 1930.3, 2192.33, 2538.74, 2764.33, 3074.36, 3582.14, 3840.3, 4039.24, 3746.1, 3825.09, 4087.56, 5500.75, 6544.17, 7867.72],
    2022: [45.36, 107.27, 95.57, 107.34, 146.58, 256.21, 375.83, 508.7, 620.97, 1114.64, 1072.84, 1264.99, 1291.54, 1297.89, 1393.15, 1464.25, 1813.5, 1957.96, 2151.91, 2484.54, 2741.15, 3018.02, 3510.55, 3900.63, 4080.79, 3769.13, 3865.06, 4100.13, 5543.78, 6789.37, 7763.14],
}
//谷物产量
var guwu = {
    2018: [32.97, 63.95, 103.18, 101.53, 130.7, 207.36, 353.39, 412.67, 535.74, 739.23, 753.59, 918.52, 1087.54, 1103.09, 1295.93, 1293.22, 1478.82, 1581.72, 2112.17, 2131.64, 2704.04, 2891.54, 2830.9, 3197.83, 3533.81, 3572.53, 3524.86, 3889.33, 5190.76, 6483.41, 6747.61],
    2019: [27.74, 69.2, 95.35, 101.94, 126.51, 221.17, 331.45, 403.76, 528.57, 718.93, 750.57, 923.03, 1131.62, 1108.1, 1259.11, 1266.77, 1496.29, 1579.4, 2072.17, 2375.71, 2579.58, 2846.78, 2825.35, 3261.82, 3769.45, 3612.04, 3566.9, 3934.96, 5203.63, 6528.85, 6652.98],
    2020: [29.35, 72.06, 91.07, 100.74, 126.25, 226.33, 337.3, 408.17, 536.05, 704.52, 753.73, 942.18, 1158.51, 1150.04, 1290.82, 1331.25, 1557.41, 1587.5, 2076.26, 2283.49, 2581.36, 2876.93, 2836.85, 3281.6, 3698.55, 3631.65, 3617.71, 3901.88, 5276.07, 6631.76, 6576.9],
    2021: [36.45, 75.39, 93.69, 103.88, 127.11, 248.43, 331.28, 410.2, 547.4, 756.58, 761.38, 971.08, 1165.71, 1132.57, 1306.68, 1334.14, 1704.14, 1605.58, 2100.12, 2485.32, 2611.88, 2932.05, 2879.44, 3529.09, 3951.64, 3649.62, 3664.7, 3973.61, 5336.81, 6345.33, 7104.39],
    2022: [43.77, 76.2, 95.33, 105.66, 127.91, 254.03, 339.34, 411.09, 546.89, 775.55, 756.39, 1004.85, 1172.6, 1156.37, 1312.16, 1380.37, 1779.36, 1613.54, 2062.77, 2431.96, 2591.49, 2880.04, 2814.75, 3529.11, 3982.58, 3672.57, 3697.02, 3979.98, 5374.58, 6582.6, 6773.49],
}
//薯类产量
var shulei = {
    2018: [0.66, 36.22, 0.39, 0.63, 14.57, 0.91, 36.38, 75.08, 35.17, 291.18, 284.89, 202.33, 94.67, 94.29, 50.71, 51.56, 11.45, 160.74, 49.1, 40.81, 97.02, 95.02, 541.3, 149.8, 36.18, 22.78, 147.87, 14.93, 84.25, 63.8, 80.69],
    2019: [0.64, 33.03, 0.35, 0.19, 16.8, 0.99, 39.43, 78.77, 33.0, 302.87, 283.64, 206.85, 97.41, 94.97, 48.69, 60.79, 15.98, 168.3, 55.95, 31.4, 106.43, 90.72, 543.23, 139.07, 31.44, 23.86, 142.27, 18.2, 99.88, 64.51, 53.05],
    2020: [0.85, 31.82, 0.22, 0.27, 17.44, 0.96, 41.54, 82.15, 38.81, 319.4, 286.21, 222.82, 97.29, 96.51, 52.6, 62.3, 15.79, 185.03, 55.62, 29.73, 106.33, 98.16, 551.77, 126.07, 31.8, 25.77, 148.79, 19.22, 114.05, 96.17, 31.91],
    2021: [0.91, 30.18, 0.14, 0.42, 17.58, 0.88, 36.19, 84.06, 43.48, 303.16, 289.31, 224.62, 102.72, 105.91, 53.1, 65.38, 20.87, 215.57, 59.07, 26.51, 110.57, 101.13, 559.2, 124.42, 25.05, 26.41, 137.81, 18.07, 109.07, 120.13, 31.65],
    2022: [0.67, 27.59, 0.1, 0.37, 17.59, 0.97, 32.59, 85.18, 43.84, 293.95, 273.0, 222.64, 107.01, 104.41, 53.74, 59.58, 19.66, 234.58, 56.2, 24.67, 109.42, 94.68, 550.4, 111.81, 18.26, 23.29, 139.47, 20.21, 110.02, 118.23, 23.26],
}
//豆类产量
var doulei = {
    2018: [0.52, 2.89, 0.17, 2.24, 1.85, 1.42, 2.81, 10.83, 28.22, 29.29, 40.86, 30.58, 11.28, 28.62, 26.16, 35.62, 13.96, 118.08, 29.43, 20.0, 38.41, 36.34, 121.5, 205.65, 62.75, 64.97, 28.13, 102.99, 44.5, 101.7, 678.5],
    2019: [0.38, 3.31, 0.2, 1.79, 1.65, 1.09, 2.27, 11.37, 30.58, 29.44, 40.95, 32.7, 11.77, 28.05, 24.2, 34.24, 14.8, 122.33, 29.33, 22.84, 38.97, 37.34, 129.92, 251.65, 77.04, 70.3, 30.08, 100.84, 53.49, 102.0, 796.98],
    2020: [0.33, 3.54, 0.15, 1.86, 1.78, 0.9, 1.65, 11.99, 30.84, 33.71, 41.48, 37.21, 11.76, 28.28, 26.6, 30.72, 10.2, 123.33, 32.0, 25.61, 39.73, 40.03, 138.81, 256.44, 72.82, 71.64, 29.39, 98.13, 56.69, 97.87, 931.97],
    2021: [0.4, 3.52, 0.13, 1.85, 1.34, 0.55, 0.97, 12.16, 30.03, 35.12, 42.15, 35.76, 11.44, 31.95, 26.76, 21.73, 10.77, 109.15, 33.14, 26.91, 41.88, 41.18, 143.5, 186.79, 62.56, 70.08, 22.58, 95.88, 54.87, 78.71, 731.68],
    2022: [0.91, 3.48, 0.14, 1.32, 1.07, 1.21, 3.89, 12.43, 30.24, 45.14, 43.45, 37.5, 11.94, 37.11, 27.25, 24.3, 14.48, 109.83, 32.94, 27.91, 40.24, 43.3, 145.39, 259.71, 79.94, 73.27, 28.58, 99.93, 59.18, 88.55, 966.39],
}
//农药使用量
var nongyao_p = ['西藏', '青海', '天津', '宁夏', '北京', '上海', '贵州', '陕西', '重庆', '海南', '新疆', '山西', '内蒙古', '甘肃', '浙江', '福建', '吉林', '四川', '云南', '辽宁', '河北', '江苏', '广西', '黑龙江', '江西', '广东', '安徽', '湖北', '河南', '湖南', '山东'];
var nongyao = {
    2018: [0.1, 0.18, 0.22, 0.23, 0.26, 0.32, 1.11, 1.26, 1.72, 2.32, 2.37, 2.65, 2.96, 4.29, 4.37, 4.91, 5.1, 5.13, 5.26, 5.51, 6.15, 6.96, 6.97, 7.42, 7.72, 9.37, 9.42, 10.33, 11.36, 11.42, 12.99],
    2019: [0.08, 0.14, 0.22, 0.22, 0.23, 0.28, 0.92, 1.22, 1.65, 2.14, 2.29, 2.53, 2.73, 4.19, 3.86, 4.55, 4.87, 4.63, 4.74, 5.11, 5.73, 6.74, 6.81, 6.43, 6.27, 8.75, 8.83, 9.7, 10.72, 10.55, 12.03],
    2020: [0.07, 0.12, 0.2, 0.22, 0.21, 0.26, 0.84, 1.2, 1.62, 1.97, 2.18, 2.49, 2.34, 4.03, 3.66, 4.32, 4.69, 4.21, 4.48, 4.47, 5.43, 6.57, 6.6, 6.07, 5.27, 8.32, 8.33, 9.31, 10.24, 10.15, 11.43],
    2021: [0.05, 0.11, 0.17, 0.22, 0.23, 0.24, 0.7, 1.16, 1.6, 1.87, 2.04, 2.36, 2.67, 2.81, 3.46, 4.17, 4.51, 4.1, 4.11, 4.34, 5.27, 6.35, 6.42, 5.71, 5.16, 7.74, 7.6, 9.05, 9.74, 9.11, 10.82],
}
//化肥使用量
var huafei_p = ['西藏', '北京', '青海', '上海', '天津', '宁夏', '海南', '浙江', '甘肃', '贵州', '重庆', '山西', '福建', '江西', '辽宁', '云南', '内蒙古', '吉林', '陕西', '广东', '四川', '湖南', '黑龙江', '新疆', '广西', '江苏', '湖北', '安徽', '河北', '山东', '河南'];
var huafei = {
    2018: [5.19, 7.29, 8.32, 8.37, 16.95, 38.37, 48.37, 77.76, 83.17, 89.48, 93.17, 109.61, 110.74, 123.2, 145.02, 217.37, 222.67, 228.3, 229.64, 231.32, 235.21, 242.61, 245.64, 254.99, 255.05, 292.45, 295.82, 311.8, 312.4, 420.35, 692.79],
    2019: [4.82, 6.17, 6.19, 7.53, 16.24, 38.44, 46.26, 72.5, 80.88, 83.18, 91.08, 108.41, 106.26, 115.57, 139.91, 204.03, 218.44, 227.06, 202.52, 225.79, 222.77, 229.01, 223.27, 257.76, 252.04, 286.21, 273.89, 298.02, 297.27, 395.34, 666.72],
    2020: [4.4, 6.06, 5.45, 6.89, 15.29, 38.06, 42.61, 69.61, 80.36, 78.78, 89.83, 107.41, 100.81, 108.81, 137.57, 196.65, 207.69, 225.29, 201.91, 219.8, 210.82, 223.73, 224.22, 248.23, 247.85, 280.75, 267.32, 289.9, 285.71, 380.88, 647.98],
    2021: [4.33, 6.3, 4.89, 6.59, 15.66, 37.46, 40.77, 68.26, 77.05, 75.98, 89.05, 105.64, 96.63, 108.59, 135.03, 187.33, 241.9, 223.0, 200.7, 212.87, 207.16, 219.06, 238.97, 240.69, 251.89, 275.56, 262.62, 284.73, 276.87, 371.03, 624.66],
    2022: [2.83, 6.61, 4.71, 6.56, 15.52, 36.88, 38.64, 67.05, 77.13, 75.41, 88.74, 103.47, 92.07, 107.71, 130.51, 183.38, 227.36, 222.75, 194.16, 208.74, 204.37, 215.87, 238.5, 243.68, 249.2, 270.14, 257.98, 280.19, 271.64, 362.09, 595.31],
}
//农用塑料薄膜
var bomo_p = ['西藏', '青海', '北京', '天津', '上海', '宁夏', '海南', '陕西', '重庆', '广东', '广西', '山西', '江西', '贵州', '吉林', '福建', '湖北', '浙江', '黑龙江', '湖南', '内蒙古', '安徽', '河北', '江苏', '辽宁', '云南', '四川', '河南', '甘肃', '新疆', '山东'];
var bomo = {
    2018: [0.177782, 0.755634, 0.82433, 0.906982, 1.47808, 1.497522, 2.5539, 4.414671, 4.4625, 4.4814, 4.719512, 4.906741, 5.2218, 5.503067, 5.6216, 6.0002, 6.3554, 6.8731, 7.7431, 8.539728, 9.39692, 9.7828, 10.9833, 11.6064, 11.797572, 11.9685, 12.0186, 15.2838, 16.1272, 26.9839, 27.6935],
    2019: [0.149182, 0.777967, 0.769888, 0.809614, 1.321304, 1.560041, 3.05501, 4.477957, 4.2559, 4.3842, 4.757733, 4.85551, 5.202, 4.412087, 5.313043, 5.8507, 5.8801, 6.6737, 7.18307, 8.379216, 9.419396, 10.3735, 10.3211, 11.4153, 11.35048, 12.2139, 12.3235, 15.0762, 15.2253, 26.26765, 26.7113],
    2020: [0.186631, 0.73783, 0.756164, 0.752085, 1.286357, 1.638824, 3.057972, 4.47241, 4.169449, 4.2558, 4.871246, 4.859198, 5.229583, 4.541055, 5.13644, 5.1824, 5.803924, 6.6892, 7.0501, 8.30045, 9.529675, 10.32989, 10.374153, 11.177559, 11.438111, 12.155765, 11.8818, 15.171738, 15.295574, 25.967405, 26.56592],
    2021: [0.175337, 0.715872, 0.71744, 0.713934, 1.171237, 1.795836, 3.424647, 4.429383, 4.115929, 4.302675, 4.540403, 4.789012, 5.21964, 4.422414, 4.765105, 4.6304, 5.726762, 6.968669, 6.100871, 7.909384, 10.025996, 10.260512, 10.203873, 10.577464, 11.438351, 11.732644, 11.696839, 14.035241, 17.072809, 26.147908, 25.967798],
}
//有效灌溉面积
var guangai_p = ['北京', '上海', '青海', '西藏', '海南', '天津', '宁夏', '重庆', '福建', '贵州', '陕西', '甘肃', '浙江', '山西', '辽宁', '广西', '广东', '吉林', '云南', '江西', '湖北', '四川', '湖南', '内蒙古', '江苏', '河北', '安徽', '新疆', '山东', '河南', '黑龙江'];
var guangai = {
    2018: [109.67, 190.76, 214.04, 264.53, 290.48, 304.66, 523.45, 696.94, 1085.18, 1132.24, 1274.99, 1337.54, 1440.8, 1518.68, 1619.33, 1706.88, 1775.21, 1893.05, 1898.07, 2032.02, 2931.9, 2932.54, 3164.0, 3196.52, 4179.83, 4492.33, 4538.29, 4883.46, 5235.99, 5288.69, 6119.57],
    2019: [109.24, 190.76, 213.33, 275.94, 290.63, 304.8, 538.29, 697.68, 1076.78, 1153.99, 1285.16, 1328.86, 1405.43, 1519.34, 1629.18, 1713.08, 1773.4, 1909.5, 1922.49, 2036.14, 2968.99, 2954.09, 3176.11, 3199.19, 4205.44, 4482.16, 4580.84, 4959.89, 5271.37, 5328.95, 6177.59],
    2020: [109.35, 165.05, 219.25, 282.82, 292.21, 299.12, 552.53, 698.32, 1110.42, 1165.49, 1336.81, 1338.6, 1415.7, 1517.38, 1632.54, 1731.03, 1776.46, 1905.44, 1978.07, 2038.49, 3086.04, 2992.24, 3192.9, 3199.12, 4224.73, 4470.03, 4608.83, 4893.35, 5293.56, 5463.07, 6171.61],
    2021: [109.32, 161.98, 217.75, 297.88, 326.62, 285.43, 563.78, 665.27, 825.77, 1270.21, 1192.47, 1298.94, 1260.54, 1498.06, 1693.05, 1434.96, 1529.21, 1918.95, 1988.24, 2158.03, 3111.09, 2784.14, 2875.06, 4379.28, 3826.29, 3952.24, 4509.87, 6666.39, 5069.92, 5518.24, 6220.51],
    2022: [112.14, 160.62, 222.01, 304.63, 330.17, 293.98, 560.57, 669.87, 855.47, 1185.17, 1161.63, 1349.48, 1226.14, 1502.01, 1716.63, 1549.35, 1560.23, 1906.48, 2035.26, 2166.49, 3208.84, 2975.74, 2876.0, 4379.31, 3851.74, 4102.86, 4576.18, 6534.69, 5209.09, 5623.22, 6152.89],
}
//受灾面积
var myData = ['北京', '上海', '西藏', '天津', '海南', '青海', '重庆', '福建', '宁夏', '广西', '浙江', '云南', '贵州', '江苏', '陕西', '四川', '江西', '广东', '河北', '湖南', '新疆', '甘肃', '山西', '安徽', '山东', '湖北', '河南', '吉林', '辽宁', '内蒙古', '黑龙江'];
var shouzai = {
    2018: [4.7, 7.3, 9.7, 14.4, 32.4, 51.9, 70.9, 78.7, 148.1, 150.0, 168.6, 274.8, 291.7, 380.0, 382.4, 484.0, 530.7, 547.8, 557.0, 625.6, 746.0, 764.2, 830.8, 863.2, 983.8, 1076.1, 1167.7, 1319.7, 1467.3, 2629.8, 4155.0],
    2019: [2.5, 8.7, 5.5, 0.0, 3.6, 70.3, 78.3, 123.1, 29.1, 247.8, 353.8, 1568.9, 141.0, 224.2, 645.1, 323.8, 1200.7, 144.7, 314.7, 997.8, 572.6, 173.6, 1473.7, 958.0, 1340.7, 1429.8, 969.8, 536.2, 324.7, 1453.5, 3540.7],
    2020: [1.6, 5.2, 9.2, 17.2, 40.4, 43.1, 158.5, 65.3, 175.4, 279.3, 114.1, 1225.0, 233.4, 135.6, 532.3, 632.5, 943.2, 84.1, 371.4, 817.1, 638.3, 395.6, 1029.9, 1237.9, 382.2, 1632.2, 670.4, 1219.4, 1321.5, 2367.8, 3178.5],
    2021: [15.0, 24.9, 7.1, 6.4, 31.9, 44.9, 59.6, 47.0, 375.8, 152.4, 149.3, 519.5, 143.9, 88.3, 972.9, 266.2, 421.1, 76.4, 388.9, 436.2, 692.0, 547.6, 1163.4, 296.1, 108.7, 506.3, 1588.1, 245.2, 249.1, 1283.6, 831.5],
    2022: [9.2, 4.2, 7.9, 4.7, 3.5, 92.9, 369.5, 105.9, 68.6, 376.0, 105.1, 810.6, 420.4, 79.0, 553.3, 615.9, 1111.9, 194.4, 135.3, 1129.7, 237.2, 487.9, 372.2, 390.4, 45.5, 1174.6, 683.4, 193.0, 797.4, 1394.9, 97.4],

};
//成灾面积
var chengzai = {
    2018: [2.2, 2.9, 8.0, 7.2, 11.3, 42.6, 46.0, 48.4, 83.7, 85.2, 107.3, 172.2, 178.6, 177.4, 276.1, 295.1, 363.4, 169.2, 356.0, 309.9, 501.9, 527.1, 587.0, 468.4, 574.5, 475.9, 850.5, 344.9, 465.3, 1580.3, 1450.6],
    2019: [0.2, 0.0, 0.3, 0.0, 0.6, 25.6, 26.5, 56.7, 7.3, 98.8, 122.6, 540.6, 43.8, 58.1, 219.3, 132.1, 666.6, 44.2, 145.0, 405.8, 246.2, 87.6, 586.7, 526.0, 685.3, 475.5, 384.0, 197.2, 77.8, 621.8, 1430.7],
    2020: [1.4, 0.0, 3.6, 11.0, 14.0, 12.9, 47.1, 21.1, 31.4, 51.2, 44.3, 420.3, 101.2, 46.8, 258.2, 230.5, 324.3, 26.5, 94.7, 221.4, 350.9, 142.0, 284.7, 779.9, 88.8, 782.3, 145.5, 591.2, 905.5, 1258.8, 701.7],
    2021: [1.5, 14.5, 1.1, 1.7, 10.3, 27.3, 27.7, 16.5, 107.7, 50.7, 38.0, 212.4, 62.9, 15.3, 316.5, 66.6, 135.3, 32.1, 192.1, 141.3, 240.9, 321.1, 402.3, 62.6, 19.2, 206.0, 672.0, 47.8, 90.8, 760.2, 387.4],
    2022: [3.3, 0.0, 3.3, 0.0, 1.5, 29.2, 128.0, 22.5, 25.3, 58.1, 45.3, 372.2, 193.3, 43.2, 177.3, 208.5, 525.1, 50.7, 58.5, 344.7, 56.4, 125.2, 84.0, 71.3, 13.3, 338.9, 67.0, 76.7, 332.6, 885.3, 32.4],

};
//数据格式修改
function generateMapData(names, values, year1) {
    var MapData = [];

    for (var i = 0; i < names.length; i++) {
        MapData.push({
            name: names[i],
            value: values[year1][i]
        });
    }
    return MapData;
}
function maxData(values, year1) {
    return Math.max.apply(null, values[year1]);
}
//种植业总产值
yearElement.textContent = 2018;
myChart.dispose();
myChart = echarts.init(document.getElementById('chart1'));
chinamap.dispose();
chinamap = echarts.init(document.querySelector(".mainbox .map .china"));
(function () {
    var timeLineData = [2018, 2019, 2020, 2021, 2022];

    option = {
        baseOption: {
            grid: {
                show: false,
                left: '4%',
                top: 60,
                bottom: "10%", // 调整底部间距
                containLabel: true,
            },
            timeline: {
                show: true,
                axisType: 'category',
                tooltip: {
                    show: true,
                    formatter: function (params) {
                        return params.name + '年数据统计';
                    }
                },
                autoPlay: true,
                currentIndex: 0,
                playInterval: 1000,
                label: {
                    normal: {
                        show: true,
                        interval: 'auto',
                        formatter: '{value}年',
                    },
                },
                lineStyle: {
                    color: '#2F4858',  // 线条颜色
                },
                itemStyle: {
                    color: '#2F4858',  // 圆点颜色
                    borderColor: '#fff',  // 圆点边框颜色
                },
                controlStyle: {
                    show: true,
                    itemSize: 15,
                    itemGap: 5,
                    normal: {
                        color: '#2F4858',  // 控制按钮颜色
                        borderColor: '#000000',  // 控制按钮边框颜色
                    },
                    emphasis: {
                        color: '#678E8C',  // 高亮状态下的控制按钮颜色
                        borderColor: '#678E8C',  // 高亮状态下的控制按钮边框颜色
                    }
                },
                checkpointStyle: {
                    color: '#2F4858',  // 播放过程中的节点颜色
                    borderColor: '#fff',  // 播放过程中的节点边框颜色
                },
                progress: {
                    lineStyle: {
                        color: '#2F4858',  // 播放过程中的线条颜色
                    },
                    itemStyle: {
                        color: '#2F4858',  // 播放过程中的圆点颜色
                        borderColor: '#fff',  // 播放过程中的圆点边框颜色
                    },
                },
                data: [],
            },
            legend: {
                data: ['种植业总产值'],
                top: 4,
                right: '20%',
                textStyle: {
                    color: '#000',
                },
            },
            tooltip: {
                show: true,
                trigger: 'axis',
                formatter: '{b}<br/>{a}: {c}亿元',
                axisPointer: {
                    type: 'shadow',
                }
            },
            yAxis: [
                {
                    type: 'value',
                    max: 7000,
                    interval: 1000,
                    axisLine: {
                        show: false,
                    },
                    axisTick: {
                        show: false,
                    },
                    position: 'top',
                    axisLabel: {
                        show: true,
                        textStyle: {
                            color: '#B2B2B2',
                            fontSize: 12,
                        },
                    },
                    splitLine: {
                        show: true,
                        lineStyle: {
                            color: '#1F2022',
                            width: 1,
                            type: 'solid',
                        },
                    },
                }],
            xAxis: [{
                type: 'category',
                position: 'right',
                axisLine: {
                    show: false
                },
                axisTick: {
                    show: false
                },
                axisLabel: {
                    show: true,
                    margin: 8,
                    textStyle: {
                        color: '#9D9EA0',
                        fontSize: 12,
                    },
                    formatter: function (value) {
                        // 将标签文字拆分为单个字符，并用换行符拼接
                        return value.split("").join("\n");
                    }
                },
                data: zhongzhiye_p,
            }],
            series: [],
        },

        options: [],
    };

    for (var i = 0; i < timeLineData.length; i++) {
        option.baseOption.timeline.data.push(timeLineData[i]);
        option.options.push({
            title: {
                text: timeLineData[i] + '年种植业总产值',
            },
            series: [{
                name: '种植业总产值',
                type: 'bar',
                barGap: 20,
                barWidth: 10,
                label: {
                    show: false,
                },
                itemStyle: {
                    normal: {
                        color: '#659F8380',
                    },
                    emphasis: {
                        color: '#659F83',
                    },
                },
                data: zhongzhiye[timeLineData[i]],
            }]
        });
    }

    //当时间改变
    myChart.on('timelinechanged', function (params) {
        var currentIndex = params.currentIndex;
        var currentYear = myChart.getOption().timeline[0].data[currentIndex];
        //更改标题
        setTimeout(function () {
            yearElement.textContent = currentYear;
            mapoption.series = [
                {
                    type: "map",
                    map: "china",
                    selectedMode: false,
                    data: generateMapData(zhongzhiye_p, zhongzhiye, currentYear),
                    itemStyle: {
                        // 修改地图区域的样式
                        areaColor: "#f4f4f4", // 主体地图颜色
                        borderColor: "#999", // 边框颜色
                        borderWidth: 1, // 边框宽度
                    },
                    emphasis: {
                        // 高亮状态下的样式
                        itemStyle: {
                            areaColor: "#ccc" // 高亮时的主体地图颜色
                        },
                        label: {
                            // 控制指定位置出现的字体样式
                            color: "#000", // 字体颜色
                        }
                    }

                }
            ]
            chinamap.setOption(mapoption);
        }, 150);

    });

    myChart.setOption(option);

    window.addEventListener("resize", function () {
        myChart.resize();
    });
})();
(function () {
    mapoption = {
        visualMap: {
            show: true,
            type: 'continuous',
            min: 0,
            max: maxData(zhongzhiye, 2022),
            color: ['#EEE8A9', '#26697C'],
            right: "17%",
            bottom: "30%"
        },
        tooltip: {
            trigger: 'item', // 触发类型，'item' 表示数据项图形触发
            formatter: function (params) {
                // 自定义显示内容
                // params.name 是地图区域名称，params.value 是对应的数据值
                return `${params.name}种植业总产值: ${params.value}亿元`;
            }
        },
        series: [
            {
                type: "map",
                map: "china",
                selectedMode: false,
                data: generateMapData(zhongzhiye_p, zhongzhiye, 2018),
                itemStyle: {
                    // 修改地图区域的样式
                    areaColor: "#f4f4f4", // 主体地图颜色
                    borderColor: "#999", // 边框颜色
                    borderWidth: 1, // 边框宽度
                },
                emphasis: {
                    // 高亮状态下的样式
                    itemStyle: {
                        areaColor: "#ccc" // 高亮时的主体地图颜色
                    },
                    label: {
                        // 控制指定位置出现的字体样式
                        color: "#34495e", // 字体颜色
                    }
                }

            }
        ]
    };
    chinamap.setOption(mapoption);

    window.addEventListener("resize", function () {
        chinamap.resize();
    });
})();

//按钮选择
document.addEventListener('DOMContentLoaded', function () {
    const radioButtons = document.querySelectorAll('input[name="radio-2"]');
    radioButtons.forEach(radio => {
        radio.addEventListener('change', function () {
            console.log('Selected button:', this.id);
            if (this.id === 'radio-2-7') {//受灾和成灾面积
                yearElement.textContent = 2018;
                myChart.dispose();
                myChart = echarts.init(document.getElementById('chart1'));
                chinamap.dispose();
                chinamap = echarts.init(document.querySelector(".mainbox .map .china"));
                (function () {
                    var timeLineData = [2018, 2019, 2020, 2021, 2022];

                    option = {
                        baseOption: {
                            timeline: {
                                show: true,
                                axisType: 'category',
                                tooltip: {
                                    show: true,
                                    formatter: function (params) {
                                        return params.name + '年数据统计';
                                    }
                                },
                                autoPlay: true,
                                currentIndex: 0,
                                playInterval: 1000,
                                label: {
                                    normal: {
                                        show: true,
                                        interval: 'auto',
                                        formatter: '{value}年',
                                    },
                                },
                                lineStyle: {
                                    color: '#2F4858',  // 线条颜色
                                },
                                itemStyle: {
                                    color: '#2F4858',  // 圆点颜色
                                    borderColor: '#fff',  // 圆点边框颜色
                                },
                                controlStyle: {
                                    show: true,
                                    itemSize: 15,
                                    itemGap: 5,
                                    normal: {
                                        color: '#2F4858',  // 控制按钮颜色
                                        borderColor: '#000000',  // 控制按钮边框颜色
                                    },
                                    emphasis: {
                                        color: '#678E8C',  // 高亮状态下的控制按钮颜色
                                        borderColor: '#678E8C',  // 高亮状态下的控制按钮边框颜色
                                    }
                                },
                                checkpointStyle: {
                                    color: '#2F4858',  // 播放过程中的节点颜色
                                    borderColor: '#fff',  // 播放过程中的节点边框颜色
                                },
                                progress: {
                                    lineStyle: {
                                        color: '#2F4858',  // 播放过程中的线条颜色
                                    },
                                    itemStyle: {
                                        color: '#2F4858',  // 播放过程中的圆点颜色
                                        borderColor: '#fff',  // 播放过程中的圆点边框颜色
                                    },
                                },
                                data: [],
                            },
                            legend: {
                                data: ['受灾面积', '成灾面积'],
                                top: 4,
                                right: '20%',
                                textStyle: {
                                    color: '#000',
                                },
                            },
                            tooltip: {
                                show: true,
                                trigger: 'axis',
                                formatter: '{b}<br/>{a}: {c}千公顷',
                                axisPointer: {
                                    type: 'shadow',
                                }
                            },

                            grid: [{
                                show: false,
                                left: '4%',
                                top: 60,
                                bottom: 60,
                                containLabel: true,
                                width: '46%',
                            }, {
                                show: false,
                                left: '50.5%',
                                top: 80,
                                bottom: 60,
                                width: '0%',
                            }, {
                                show: false,
                                right: '4%',
                                top: 60,
                                bottom: 60,
                                containLabel: true,
                                width: '46%',
                            },],

                            xAxis: [
                                {
                                    type: 'value',
                                    inverse: true,
                                    max: 3600,
                                    interval: 600,
                                    axisLine: {
                                        show: false,
                                    },
                                    axisTick: {
                                        show: false,
                                    },
                                    position: 'top',
                                    axisLabel: {
                                        show: true,
                                        textStyle: {
                                            color: '#B2B2B2',
                                            fontSize: 12,
                                        },
                                    },
                                    splitLine: {
                                        show: true,
                                        lineStyle: {
                                            color: '#1F2022',
                                            width: 1,
                                            type: 'solid',
                                        },
                                    },
                                }, {
                                    gridIndex: 1,
                                    show: false,
                                }, {
                                    gridIndex: 2,
                                    type: 'value',
                                    max: 3600,
                                    interval: 600,
                                    axisLine: {
                                        show: false,
                                    },
                                    axisTick: {
                                        show: false,
                                    },
                                    position: 'top',
                                    axisLabel: {
                                        show: true,
                                        textStyle: {
                                            color: '#B2B2B2',
                                            fontSize: 12,
                                        },
                                    },
                                    splitLine: {
                                        show: true,
                                        lineStyle: {
                                            color: '#1F2022',
                                            width: 1,
                                            type: 'solid',
                                        },
                                    },
                                },],
                            yAxis: [{
                                type: 'category',
                                inverse: true,
                                position: 'right',
                                axisLine: {
                                    show: false
                                },
                                axisTick: {
                                    show: false
                                },
                                axisLabel: {
                                    show: false,
                                    margin: 8,
                                    textStyle: {
                                        color: '#9D9EA0',
                                        fontSize: 12,
                                    },

                                },
                                data: myData,
                            }, {
                                gridIndex: 1,
                                type: 'category',
                                inverse: true,
                                position: 'left',
                                axisLine: {
                                    show: false
                                },
                                axisTick: {
                                    show: false
                                },
                                axisLabel: {
                                    show: true,
                                    interval: 0,
                                    textStyle: {
                                        color: '#9D9EA0',
                                        fontSize: 10,
                                    },

                                },
                                data: myData.map(function (value) {
                                    return {
                                        value: value,
                                        textStyle: {
                                            align: 'center',
                                        }
                                    }
                                }),
                            }, {
                                gridIndex: 2,
                                type: 'category',
                                inverse: true,
                                position: 'left',
                                axisLine: {
                                    show: false
                                },
                                axisTick: {
                                    show: false
                                },
                                axisLabel: {
                                    show: false,
                                    textStyle: {
                                        color: '#9D9EA0',
                                        fontSize: 12,
                                    },

                                },
                                data: myData,
                            },],
                            series: [],

                        },

                        options: [],


                    };

                    for (var i = 0; i < timeLineData.length; i++) {
                        option.baseOption.timeline.data.push(timeLineData[i]);
                        option.options.push({
                            title: {
                                text: timeLineData[i] + '年农业受灾和成灾面积',
                            },
                            series: [{
                                name: '受灾面积',
                                type: 'bar',
                                barGap: 20,
                                barWidth: 10,
                                label: {
                                    normal: {
                                        show: false,
                                    },
                                    emphasis: {
                                        show: true,
                                        position: 'left',
                                        offset: [0, 0],
                                        textStyle: {
                                            color: '#2F4858',
                                            fontSize: 14,
                                        },
                                    },
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#659F8380',
                                    },
                                    emphasis: {
                                        color: '#659F83',
                                    },
                                },
                                data: shouzai[timeLineData[i]],
                            },


                            {
                                name: '成灾面积',
                                type: 'bar',
                                barGap: 20,
                                barWidth: 10,
                                xAxisIndex: 2,
                                yAxisIndex: 2,
                                label: {
                                    normal: {
                                        show: false,
                                    },
                                    emphasis: {
                                        show: true,
                                        position: 'right',
                                        offset: [0, 0],
                                        textStyle: {
                                            color: '#2F4858',
                                            fontSize: 14,
                                        },
                                    },
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#00759C80',
                                    },
                                    emphasis: {
                                        color: '#00759C',
                                    },
                                },
                                data: chengzai[timeLineData[i]],
                            }
                            ]
                        });
                    }
                    //当时间改变
                    myChart.on('timelinechanged', function (params) {
                        var currentIndex = params.currentIndex;
                        var currentYear = myChart.getOption().timeline[0].data[currentIndex];
                        //更改标题
                        setTimeout(function () {
                            yearElement.textContent = currentYear;
                            //更改中国地图
                            mapoption.series = [
                                {
                                    type: "map",
                                    map: "china",
                                    selectedMode: false,
                                    data: generateMapData(myData, chengzai, currentYear),
                                    itemStyle: {
                                        // 修改地图区域的样式
                                        areaColor: "#f4f4f4", // 主体地图颜色
                                        borderColor: "#999", // 边框颜色
                                        borderWidth: 1, // 边框宽度
                                    },
                                    emphasis: {
                                        // 高亮状态下的样式
                                        itemStyle: {
                                            areaColor: "#ccc" // 高亮时的主体地图颜色
                                        },
                                        label: {
                                            // 控制指定位置出现的字体样式
                                            color: "#000", // 字体颜色
                                        }
                                    }

                                }
                            ]
                            chinamap.setOption(mapoption);
                        }, 150);
                    });

                    myChart.setOption(option);

                    window.addEventListener("resize", function () {
                        myChart.resize();
                    });
                })();
                (function () {
                    mapoption = {
                        visualMap: {
                            show: true,
                            type: 'continuous',
                            min: 0,
                            max: maxData(chengzai, 2018),
                            color: ['#EEE8A9', '#26697C'],
                            right: "17%",
                            bottom: "30%"
                        },
                        tooltip: {
                            trigger: 'item', // 触发类型，'item' 表示数据项图形触发
                            formatter: function (params) {
                                // 自定义显示内容
                                // params.name 是地图区域名称，params.value 是对应的数据值
                                return `${params.name}成灾面积: ${params.value}千公顷`;
                            }
                        },
                        series: [
                            {
                                type: "map",
                                map: "china",
                                selectedMode: false,
                                data: generateMapData(myData, chengzai, 2018),
                                itemStyle: {
                                    // 修改地图区域的样式
                                    areaColor: "#f4f4f4", // 主体地图颜色
                                    borderColor: "#999", // 边框颜色
                                    borderWidth: 1, // 边框宽度
                                },
                                emphasis: {
                                    // 高亮状态下的样式
                                    itemStyle: {
                                        areaColor: "#ccc" // 高亮时的主体地图颜色
                                    },
                                    label: {
                                        // 控制指定位置出现的字体样式
                                        color: "#000", // 字体颜色
                                    }
                                }

                            }
                        ]
                    };
                    chinamap.setOption(mapoption);

                    window.addEventListener("resize", function () {
                        chinamap.resize();
                    });
                })();
            }
            else if (this.id === 'radio-2-1') {//种植业总产值
                yearElement.textContent = 2018;
                myChart.dispose();
                myChart = echarts.init(document.getElementById('chart1'));
                chinamap.dispose();
                chinamap = echarts.init(document.querySelector(".mainbox .map .china"));
                (function () {
                    var timeLineData = [2018, 2019, 2020, 2021, 2022];

                    option = {
                        baseOption: {
                            grid: {
                                show: false,
                                left: '4%',
                                top: 60,
                                bottom: "10%", // 调整底部间距
                                containLabel: true,
                            },
                            timeline: {
                                show: true,
                                axisType: 'category',
                                tooltip: {
                                    show: true,
                                    formatter: function (params) {
                                        return params.name + '年数据统计';
                                    }
                                },
                                autoPlay: true,
                                currentIndex: 0,
                                playInterval: 1000,
                                label: {
                                    normal: {
                                        show: true,
                                        interval: 'auto',
                                        formatter: '{value}年',
                                    },
                                },
                                lineStyle: {
                                    color: '#2F4858',  // 线条颜色
                                },
                                itemStyle: {
                                    color: '#2F4858',  // 圆点颜色
                                    borderColor: '#fff',  // 圆点边框颜色
                                },
                                controlStyle: {
                                    show: true,
                                    itemSize: 15,
                                    itemGap: 5,
                                    normal: {
                                        color: '#2F4858',  // 控制按钮颜色
                                        borderColor: '#000000',  // 控制按钮边框颜色
                                    },
                                    emphasis: {
                                        color: '#678E8C',  // 高亮状态下的控制按钮颜色
                                        borderColor: '#678E8C',  // 高亮状态下的控制按钮边框颜色
                                    }
                                },
                                checkpointStyle: {
                                    color: '#2F4858',  // 播放过程中的节点颜色
                                    borderColor: '#fff',  // 播放过程中的节点边框颜色
                                },
                                progress: {
                                    lineStyle: {
                                        color: '#2F4858',  // 播放过程中的线条颜色
                                    },
                                    itemStyle: {
                                        color: '#2F4858',  // 播放过程中的圆点颜色
                                        borderColor: '#fff',  // 播放过程中的圆点边框颜色
                                    },
                                },
                                data: [],
                            },
                            legend: {
                                data: ['种植业总产值'],
                                top: 4,
                                right: '20%',
                                textStyle: {
                                    color: '#000',
                                },
                            },
                            tooltip: {
                                show: true,
                                trigger: 'axis',
                                formatter: '{b}<br/>{a}: {c}亿元',
                                axisPointer: {
                                    type: 'shadow',
                                }
                            },
                            yAxis: [
                                {
                                    type: 'value',
                                    max: 7000,
                                    interval: 1000,
                                    axisLine: {
                                        show: false,
                                    },
                                    axisTick: {
                                        show: false,
                                    },
                                    position: 'top',
                                    axisLabel: {
                                        show: true,
                                        textStyle: {
                                            color: '#B2B2B2',
                                            fontSize: 12,
                                        },
                                    },
                                    splitLine: {
                                        show: true,
                                        lineStyle: {
                                            color: '#1F2022',
                                            width: 1,
                                            type: 'solid',
                                        },
                                    },
                                }],
                            xAxis: [{
                                type: 'category',
                                position: 'right',
                                axisLine: {
                                    show: false
                                },
                                axisTick: {
                                    show: false
                                },
                                axisLabel: {
                                    show: true,
                                    margin: 8,
                                    textStyle: {
                                        color: '#9D9EA0',
                                        fontSize: 12,
                                    },
                                    formatter: function (value) {
                                        // 将标签文字拆分为单个字符，并用换行符拼接
                                        return value.split("").join("\n");
                                    }
                                },
                                data: zhongzhiye_p,
                            }],
                            series: [],
                        },

                        options: [],
                    };

                    for (var i = 0; i < timeLineData.length; i++) {
                        option.baseOption.timeline.data.push(timeLineData[i]);
                        option.options.push({
                            title: {
                                text: timeLineData[i] + '年种植业总产值',
                            },
                            series: [{
                                name: '种植业总产值',
                                type: 'bar',
                                barGap: 20,
                                barWidth: 10,
                                label: {
                                    show: false,
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#659F8380',
                                    },
                                    emphasis: {
                                        color: '#659F83',
                                    },
                                },
                                data: zhongzhiye[timeLineData[i]],
                            }]
                        });
                    }

                    //当时间改变
                    myChart.on('timelinechanged', function (params) {
                        var currentIndex = params.currentIndex;
                        var currentYear = myChart.getOption().timeline[0].data[currentIndex];
                        //更改标题
                        setTimeout(function () {
                            yearElement.textContent = currentYear;
                            mapoption.series = [
                                {
                                    type: "map",
                                    map: "china",
                                    selectedMode: false,
                                    data: generateMapData(zhongzhiye_p, zhongzhiye, currentYear),
                                    itemStyle: {
                                        // 修改地图区域的样式
                                        areaColor: "#f4f4f4", // 主体地图颜色
                                        borderColor: "#999", // 边框颜色
                                        borderWidth: 1, // 边框宽度
                                    },
                                    emphasis: {
                                        // 高亮状态下的样式
                                        itemStyle: {
                                            areaColor: "#ccc" // 高亮时的主体地图颜色
                                        },
                                        label: {
                                            // 控制指定位置出现的字体样式
                                            color: "#000", // 字体颜色
                                        }
                                    }

                                }
                            ]
                            chinamap.setOption(mapoption);
                        }, 150);

                    });

                    myChart.setOption(option);

                    window.addEventListener("resize", function () {
                        myChart.resize();
                    });
                })();
                (function () {
                    mapoption = {
                        visualMap: {
                            show: true,
                            type: 'continuous',
                            min: 0,
                            max: maxData(zhongzhiye, 2022),
                            color: ['#EEE8A9', '#26697C'],
                            right: "17%",
                            bottom: "30%"
                        },
                        tooltip: {
                            trigger: 'item', // 触发类型，'item' 表示数据项图形触发
                            formatter: function (params) {
                                // 自定义显示内容
                                // params.name 是地图区域名称，params.value 是对应的数据值
                                return `${params.name}种植业总产值: ${params.value}亿元`;
                            }
                        },
                        series: [
                            {
                                type: "map",
                                map: "china",
                                selectedMode: false,
                                data: generateMapData(zhongzhiye_p, zhongzhiye, 2018),
                                itemStyle: {
                                    // 修改地图区域的样式
                                    areaColor: "#f4f4f4", // 主体地图颜色
                                    borderColor: "#999", // 边框颜色
                                    borderWidth: 1, // 边框宽度
                                },
                                emphasis: {
                                    // 高亮状态下的样式
                                    itemStyle: {
                                        areaColor: "#ccc" // 高亮时的主体地图颜色
                                    },
                                    label: {
                                        // 控制指定位置出现的字体样式
                                        color: "#000", // 字体颜色
                                    }
                                }

                            }
                        ]
                    };
                    chinamap.setOption(mapoption);

                    window.addEventListener("resize", function () {
                        chinamap.resize();
                    });
                })();
            }
            else if (this.id === 'radio-2-2') {//粮食产量
                yearElement.textContent = 2018;
                myChart.dispose();
                myChart = echarts.init(document.getElementById('chart1'));
                chinamap.dispose();
                chinamap = echarts.init(document.querySelector(".mainbox .map .china"));
                (function () {
                    var timeLineData = [2018, 2019, 2020, 2021, 2022];

                    option = {
                        baseOption: {
                            grid: {
                                show: false,
                                left: '4%',
                                top: 60,
                                bottom: "10%", // 调整底部间距
                                containLabel: true,
                            },
                            timeline: {
                                show: true,
                                axisType: 'category',
                                tooltip: {
                                    show: true,
                                    formatter: function (params) {
                                        return params.name + '年数据统计';
                                    }
                                },
                                autoPlay: true,
                                currentIndex: 0,
                                playInterval: 1000,
                                label: {
                                    normal: {
                                        show: true,
                                        interval: 'auto',
                                        formatter: '{value}年',
                                    },
                                },
                                lineStyle: {
                                    color: '#2F4858',  // 线条颜色
                                },
                                itemStyle: {
                                    color: '#2F4858',  // 圆点颜色
                                    borderColor: '#fff',  // 圆点边框颜色
                                },
                                controlStyle: {
                                    show: true,
                                    itemSize: 15,
                                    itemGap: 5,
                                    normal: {
                                        color: '#2F4858',  // 控制按钮颜色
                                        borderColor: '#000000',  // 控制按钮边框颜色
                                    },
                                    emphasis: {
                                        color: '#678E8C',  // 高亮状态下的控制按钮颜色
                                        borderColor: '#678E8C',  // 高亮状态下的控制按钮边框颜色
                                    }
                                },
                                checkpointStyle: {
                                    color: '#2F4858',  // 播放过程中的节点颜色
                                    borderColor: '#fff',  // 播放过程中的节点边框颜色
                                },
                                progress: {
                                    lineStyle: {
                                        color: '#2F4858',  // 播放过程中的线条颜色
                                    },
                                    itemStyle: {
                                        color: '#2F4858',  // 播放过程中的圆点颜色
                                        borderColor: '#fff',  // 播放过程中的圆点边框颜色
                                    },
                                },
                                data: [],
                            },
                            legend: {
                                data: ['谷物产量', '豆类产量', '薯类产量'],
                                top: 4,
                                right: '20%',
                                textStyle: {
                                    color: '#000',
                                },
                            },
                            tooltip: {
                                show: true,
                                trigger: 'axis',
                                formatter: function (params) {
                                    var total = 0;
                                    for (var j = 0; j < params.length; j++) {
                                        total += params[j].value;
                                    }
                                    return '粮食总产量' + '<br/>' + params[0].axisValue + ': ' + total.toFixed(2) + '万吨';
                                },
                                axisPointer: {
                                    type: 'shadow',
                                }
                            },
                            yAxis: [
                                {
                                    type: 'value',
                                    max: 9000,
                                    interval: 1000,
                                    axisLine: {
                                        show: false,
                                    },
                                    axisTick: {
                                        show: false,
                                    },
                                    position: 'top',
                                    axisLabel: {
                                        show: true,
                                        textStyle: {
                                            color: '#B2B2B2',
                                            fontSize: 12,
                                        },
                                    },
                                    splitLine: {
                                        show: true,
                                        lineStyle: {
                                            color: '#1F2022',
                                            width: 1,
                                            type: 'solid',
                                        },
                                    },
                                }],
                            xAxis: [{
                                type: 'category',
                                position: 'right',
                                axisLine: {
                                    show: false
                                },
                                axisTick: {
                                    show: false
                                },
                                axisLabel: {
                                    show: true,
                                    margin: 8,
                                    textStyle: {
                                        color: '#9D9EA0',
                                        fontSize: 12,
                                    },
                                    formatter: function (value) {
                                        // 将标签文字拆分为单个字符，并用换行符拼接
                                        return value.split("").join("\n");
                                    }
                                },
                                data: liangshi_p,
                            }],
                            series: [],
                        },

                        options: [],
                    };

                    for (var i = 0; i < timeLineData.length; i++) {
                        option.baseOption.timeline.data.push(timeLineData[i]);
                        option.options.push({
                            title: {
                                text: timeLineData[i] + '年粮食产量',
                            },
                            series: [{
                                name: '谷物产量',
                                type: 'bar',
                                barGap: 20,
                                barWidth: 10,
                                stack: "总量",
                                label: {
                                    normal: {
                                        show: false,
                                    },
                                    emphasis: {
                                        show: true,
                                        position: 'inner',
                                        offset: [0, 0],
                                        textStyle: {
                                            color: '#2F4858',
                                            fontSize: 14,
                                        },
                                    },
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#659F8380',
                                    },
                                    emphasis: {
                                        color: '#659F83',
                                    },
                                },
                                data: guwu[timeLineData[i]],
                            }, {
                                name: '豆类产量',
                                type: 'bar',
                                barGap: 20,
                                barWidth: 10,
                                stack: "总量",
                                label: {
                                    normal: {
                                        show: false,
                                    },
                                    emphasis: {
                                        show: true,
                                        position: 'left',
                                        offset: [0, 0],
                                        textStyle: {
                                            color: '#00759C',
                                            fontSize: 14,
                                        },
                                    },
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#00759C80',
                                    },
                                    emphasis: {
                                        color: '#00759C',
                                    },
                                },
                                data: doulei[timeLineData[i]],
                            }, {
                                name: '薯类产量',
                                type: 'bar',
                                barGap: 20,
                                barWidth: 10,
                                stack: "总量",
                                label: {
                                    normal: {
                                        show: false,
                                    },
                                    emphasis: {
                                        show: true,
                                        position: 'top',
                                        offset: [0, 0],
                                        textStyle: {
                                            color: '#948BCC',
                                            fontSize: 14,
                                        },
                                    },
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#948BCC80',
                                    },
                                    emphasis: {
                                        color: '#948BCC',
                                    },
                                },
                                data: shulei[timeLineData[i]],
                            },]
                        });
                    }

                    //当时间改变
                    myChart.on('timelinechanged', function (params) {
                        var currentIndex = params.currentIndex;
                        var currentYear = myChart.getOption().timeline[0].data[currentIndex];
                        //更改标题
                        setTimeout(function () {
                            yearElement.textContent = currentYear;
                            mapoption.series = [
                                {
                                    type: "map",
                                    map: "china",
                                    selectedMode: false,
                                    data: generateMapData(liangshi_p, liangshi, currentYear),
                                    itemStyle: {
                                        // 修改地图区域的样式
                                        areaColor: "#f4f4f4", // 主体地图颜色
                                        borderColor: "#999", // 边框颜色
                                        borderWidth: 1, // 边框宽度
                                    },
                                    emphasis: {
                                        // 高亮状态下的样式
                                        itemStyle: {
                                            areaColor: "#ccc" // 高亮时的主体地图颜色
                                        },
                                        label: {
                                            // 控制指定位置出现的字体样式
                                            color: "#000", // 字体颜色
                                        }
                                    }

                                }
                            ]
                            chinamap.setOption(mapoption);
                        }, 150);

                    });

                    myChart.setOption(option);

                    window.addEventListener("resize", function () {
                        myChart.resize();
                    });
                })();
                (function () {
                    mapoption = {
                        visualMap: {
                            show: true,
                            type: 'continuous',
                            min: 0,
                            max: maxData(liangshi, 2022),
                            color: ['#EEE8A9', '#26697C'],
                            right: "17%",
                            bottom: "30%"
                        },
                        tooltip: {
                            trigger: 'item', // 触发类型，'item' 表示数据项图形触发
                            formatter: function (params) {
                                // 自定义显示内容
                                // params.name 是地图区域名称，params.value 是对应的数据值
                                return `${params.name}粮食产量: ${params.value}万吨`;
                            }
                        },
                        series: [
                            {
                                type: "map",
                                map: "china",
                                selectedMode: false,
                                data: generateMapData(liangshi_p, liangshi, 2018),
                                itemStyle: {
                                    // 修改地图区域的样式
                                    areaColor: "#f4f4f4", // 主体地图颜色
                                    borderColor: "#999", // 边框颜色
                                    borderWidth: 1, // 边框宽度
                                },
                                emphasis: {
                                    // 高亮状态下的样式
                                    itemStyle: {
                                        areaColor: "#ccc" // 高亮时的主体地图颜色
                                    },
                                    label: {
                                        // 控制指定位置出现的字体样式
                                        color: "#000", // 字体颜色
                                    }
                                }

                            }
                        ]
                    };
                    chinamap.setOption(mapoption);

                    window.addEventListener("resize", function () {
                        chinamap.resize();
                    });
                })();
            }
            else if (this.id === 'radio-2-3') {//农药
                yearElement.textContent = 2018;
                myChart.dispose();
                myChart = echarts.init(document.getElementById('chart1'));
                chinamap.dispose();
                chinamap = echarts.init(document.querySelector(".mainbox .map .china"));
                (function () {
                    var timeLineData = [2018, 2019, 2020, 2021];

                    option = {
                        baseOption: {
                            grid: {
                                show: false,
                                left: '4%',
                                top: 60,
                                bottom: "10%", // 调整底部间距
                                containLabel: true,
                            },
                            timeline: {
                                show: true,
                                axisType: 'category',
                                tooltip: {
                                    show: true,
                                    formatter: function (params) {
                                        return params.name + '年数据统计';
                                    }
                                },
                                autoPlay: true,
                                currentIndex: 0,
                                playInterval: 1000,
                                label: {
                                    normal: {
                                        show: true,
                                        interval: 'auto',
                                        formatter: '{value}年',
                                    },
                                },
                                lineStyle: {
                                    color: '#2F4858',  // 线条颜色
                                },
                                itemStyle: {
                                    color: '#2F4858',  // 圆点颜色
                                    borderColor: '#fff',  // 圆点边框颜色
                                },
                                controlStyle: {
                                    show: true,
                                    itemSize: 15,
                                    itemGap: 5,
                                    normal: {
                                        color: '#2F4858',  // 控制按钮颜色
                                        borderColor: '#000000',  // 控制按钮边框颜色
                                    },
                                    emphasis: {
                                        color: '#678E8C',  // 高亮状态下的控制按钮颜色
                                        borderColor: '#678E8C',  // 高亮状态下的控制按钮边框颜色
                                    }
                                },
                                checkpointStyle: {
                                    color: '#2F4858',  // 播放过程中的节点颜色
                                    borderColor: '#fff',  // 播放过程中的节点边框颜色
                                },
                                progress: {
                                    lineStyle: {
                                        color: '#2F4858',  // 播放过程中的线条颜色
                                    },
                                    itemStyle: {
                                        color: '#2F4858',  // 播放过程中的圆点颜色
                                        borderColor: '#fff',  // 播放过程中的圆点边框颜色
                                    },
                                },
                                data: [],
                            },
                            legend: {
                                data: ['农药使用量'],
                                top: 4,
                                right: '20%',
                                textStyle: {
                                    color: '#000',
                                },
                            },
                            tooltip: {
                                show: true,
                                trigger: 'axis',
                                formatter: '{b}<br/>{a}: {c}万吨',
                                axisPointer: {
                                    type: 'shadow',
                                }
                            },
                            yAxis: [
                                {
                                    type: 'value',
                                    max: 14,
                                    interval: 2,
                                    axisLine: {
                                        show: false,
                                    },
                                    axisTick: {
                                        show: false,
                                    },
                                    position: 'top',
                                    axisLabel: {
                                        show: true,
                                        textStyle: {
                                            color: '#B2B2B2',
                                            fontSize: 12,
                                        },
                                    },
                                    splitLine: {
                                        show: true,
                                        lineStyle: {
                                            color: '#1F2022',
                                            width: 1,
                                            type: 'solid',
                                        },
                                    },
                                }],
                            xAxis: [{
                                type: 'category',
                                position: 'right',
                                axisLine: {
                                    show: false
                                },
                                axisTick: {
                                    show: false
                                },
                                axisLabel: {
                                    show: true,
                                    margin: 8,
                                    textStyle: {
                                        color: '#9D9EA0',
                                        fontSize: 12,
                                    },
                                    formatter: function (value) {
                                        // 将标签文字拆分为单个字符，并用换行符拼接
                                        return value.split("").join("\n");
                                    }
                                },
                                data: nongyao_p,
                            }],
                            series: [],
                        },

                        options: [],
                    };

                    for (var i = 0; i < timeLineData.length; i++) {
                        option.baseOption.timeline.data.push(timeLineData[i]);
                        option.options.push({
                            title: {
                                text: timeLineData[i] + '年农药使用量',
                            },
                            series: [{
                                name: '农药使用量',
                                type: 'bar',
                                barGap: 20,
                                barWidth: 10,
                                label: {
                                    show: false,
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#659F8380',
                                    },
                                    emphasis: {
                                        color: '#659F83',
                                    },
                                },
                                data: nongyao[timeLineData[i]],
                            }]
                        });
                    }

                    //当时间改变
                    myChart.on('timelinechanged', function (params) {
                        var currentIndex = params.currentIndex;
                        var currentYear = myChart.getOption().timeline[0].data[currentIndex];
                        //更改标题
                        setTimeout(function () {
                            yearElement.textContent = currentYear;
                            mapoption.series = [
                                {
                                    type: "map",
                                    map: "china",
                                    selectedMode: false,
                                    data: generateMapData(nongyao_p, nongyao, currentYear),
                                    itemStyle: {
                                        // 修改地图区域的样式
                                        areaColor: "#f4f4f4", // 主体地图颜色
                                        borderColor: "#999", // 边框颜色
                                        borderWidth: 1, // 边框宽度
                                    },
                                    emphasis: {
                                        // 高亮状态下的样式
                                        itemStyle: {
                                            areaColor: "#ccc" // 高亮时的主体地图颜色
                                        },
                                        label: {
                                            // 控制指定位置出现的字体样式
                                            color: "#000", // 字体颜色
                                        }
                                    }

                                }
                            ]
                            chinamap.setOption(mapoption);
                        }, 150);

                    });

                    myChart.setOption(option);

                    window.addEventListener("resize", function () {
                        myChart.resize();
                    });
                })();
                (function () {
                    mapoption = {
                        visualMap: {
                            show: true,
                            type: 'continuous',
                            min: 0,
                            max: maxData(nongyao, 2018),
                            color: ['#EEE8A9', '#26697C'],
                            right: "17%",
                            bottom: "30%"
                        },
                        tooltip: {
                            trigger: 'item', // 触发类型，'item' 表示数据项图形触发
                            formatter: function (params) {
                                // 自定义显示内容
                                // params.name 是地图区域名称，params.value 是对应的数据值
                                return `${params.name}农药使用量: ${params.value}万吨`;
                            }
                        },
                        series: [
                            {
                                type: "map",
                                map: "china",
                                selectedMode: false,
                                data: generateMapData(nongyao_p, nongyao, 2018),
                                itemStyle: {
                                    // 修改地图区域的样式
                                    areaColor: "#f4f4f4", // 主体地图颜色
                                    borderColor: "#999", // 边框颜色
                                    borderWidth: 1, // 边框宽度
                                },
                                emphasis: {
                                    // 高亮状态下的样式
                                    itemStyle: {
                                        areaColor: "#ccc" // 高亮时的主体地图颜色
                                    },
                                    label: {
                                        // 控制指定位置出现的字体样式
                                        color: "#000", // 字体颜色
                                    }
                                }

                            }
                        ]
                    };
                    chinamap.setOption(mapoption);

                    window.addEventListener("resize", function () {
                        chinamap.resize();
                    });
                })();
            }
            else if (this.id === 'radio-2-4') {//化肥
                yearElement.textContent = 2018;
                myChart.dispose();
                myChart = echarts.init(document.getElementById('chart1'));
                chinamap.dispose();
                chinamap = echarts.init(document.querySelector(".mainbox .map .china"));
                (function () {
                    var timeLineData = [2018, 2019, 2020, 2021, 2022];

                    option = {
                        baseOption: {
                            grid: {
                                show: false,
                                left: '4%',
                                top: 60,
                                bottom: "10%", // 调整底部间距
                                containLabel: true,
                            },
                            timeline: {
                                show: true,
                                axisType: 'category',
                                tooltip: {
                                    show: true,
                                    formatter: function (params) {
                                        return params.name + '年数据统计';
                                    }
                                },
                                autoPlay: true,
                                currentIndex: 0,
                                playInterval: 1000,
                                label: {
                                    normal: {
                                        show: true,
                                        interval: 'auto',
                                        formatter: '{value}年',
                                    },
                                },
                                lineStyle: {
                                    color: '#2F4858',  // 线条颜色
                                },
                                itemStyle: {
                                    color: '#2F4858',  // 圆点颜色
                                    borderColor: '#fff',  // 圆点边框颜色
                                },
                                controlStyle: {
                                    show: true,
                                    itemSize: 15,
                                    itemGap: 5,
                                    normal: {
                                        color: '#2F4858',  // 控制按钮颜色
                                        borderColor: '#000000',  // 控制按钮边框颜色
                                    },
                                    emphasis: {
                                        color: '#678E8C',  // 高亮状态下的控制按钮颜色
                                        borderColor: '#678E8C',  // 高亮状态下的控制按钮边框颜色
                                    }
                                },
                                checkpointStyle: {
                                    color: '#2F4858',  // 播放过程中的节点颜色
                                    borderColor: '#fff',  // 播放过程中的节点边框颜色
                                },
                                progress: {
                                    lineStyle: {
                                        color: '#2F4858',  // 播放过程中的线条颜色
                                    },
                                    itemStyle: {
                                        color: '#2F4858',  // 播放过程中的圆点颜色
                                        borderColor: '#fff',  // 播放过程中的圆点边框颜色
                                    },
                                },
                                data: [],
                            },
                            legend: {
                                data: ['化肥使用量'],
                                top: 4,
                                right: '20%',
                                textStyle: {
                                    color: '#000',
                                },
                            },
                            tooltip: {
                                show: true,
                                trigger: 'axis',
                                formatter: '{b}<br/>{a}: {c}万吨',
                                axisPointer: {
                                    type: 'shadow',
                                }
                            },
                            yAxis: [
                                {
                                    type: 'value',
                                    max: 700,
                                    interval: 100,
                                    axisLine: {
                                        show: false,
                                    },
                                    axisTick: {
                                        show: false,
                                    },
                                    position: 'top',
                                    axisLabel: {
                                        show: true,
                                        textStyle: {
                                            color: '#B2B2B2',
                                            fontSize: 12,
                                        },
                                    },
                                    splitLine: {
                                        show: true,
                                        lineStyle: {
                                            color: '#1F2022',
                                            width: 1,
                                            type: 'solid',
                                        },
                                    },
                                }],
                            xAxis: [{
                                type: 'category',
                                position: 'right',
                                axisLine: {
                                    show: false
                                },
                                axisTick: {
                                    show: false
                                },
                                axisLabel: {
                                    show: true,
                                    margin: 8,
                                    textStyle: {
                                        color: '#9D9EA0',
                                        fontSize: 12,
                                    },
                                    formatter: function (value) {
                                        // 将标签文字拆分为单个字符，并用换行符拼接
                                        return value.split("").join("\n");
                                    }
                                },
                                data: huafei_p,
                            }],
                            series: [],
                        },

                        options: [],
                    };

                    for (var i = 0; i < timeLineData.length; i++) {
                        option.baseOption.timeline.data.push(timeLineData[i]);
                        option.options.push({
                            title: {
                                text: timeLineData[i] + '年化肥使用量',
                            },
                            series: [{
                                name: '化肥使用量',
                                type: 'bar',
                                barGap: 20,
                                barWidth: 10,
                                label: {
                                    show: false,
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#659F8380',
                                    },
                                    emphasis: {
                                        color: '#659F83',
                                    },
                                },
                                data: huafei[timeLineData[i]],
                            }]
                        });
                    }

                    //当时间改变
                    myChart.on('timelinechanged', function (params) {
                        var currentIndex = params.currentIndex;
                        var currentYear = myChart.getOption().timeline[0].data[currentIndex];
                        //更改标题
                        setTimeout(function () {
                            yearElement.textContent = currentYear;
                            mapoption.series = [
                                {
                                    type: "map",
                                    map: "china",
                                    selectedMode: false,
                                    data: generateMapData(huafei_p, huafei, currentYear),
                                    itemStyle: {
                                        // 修改地图区域的样式
                                        areaColor: "#f4f4f4", // 主体地图颜色
                                        borderColor: "#999", // 边框颜色
                                        borderWidth: 1, // 边框宽度
                                    },
                                    emphasis: {
                                        // 高亮状态下的样式
                                        itemStyle: {
                                            areaColor: "#ccc" // 高亮时的主体地图颜色
                                        },
                                        label: {
                                            // 控制指定位置出现的字体样式
                                            color: "#000", // 字体颜色
                                        }
                                    }

                                }
                            ]
                            chinamap.setOption(mapoption);
                        }, 150);

                    });

                    myChart.setOption(option);

                    window.addEventListener("resize", function () {
                        myChart.resize();
                    });
                })();
                (function () {
                    mapoption = {
                        visualMap: {
                            show: true,
                            type: 'continuous',
                            min: 0,
                            max: maxData(huafei, 2018),
                            color: ['#EEE8A9', '#26697C'],
                            right: "17%",
                            bottom: "30%"
                        },
                        tooltip: {
                            trigger: 'item', // 触发类型，'item' 表示数据项图形触发
                            formatter: function (params) {
                                // 自定义显示内容
                                // params.name 是地图区域名称，params.value 是对应的数据值
                                return `${params.name}化肥使用量: ${params.value}万吨`;
                            }
                        },
                        series: [
                            {
                                type: "map",
                                map: "china",
                                selectedMode: false,
                                data: generateMapData(huafei_p, huafei, 2018),
                                itemStyle: {
                                    // 修改地图区域的样式
                                    areaColor: "#f4f4f4", // 主体地图颜色
                                    borderColor: "#999", // 边框颜色
                                    borderWidth: 1, // 边框宽度
                                },
                                emphasis: {
                                    // 高亮状态下的样式
                                    itemStyle: {
                                        areaColor: "#ccc" // 高亮时的主体地图颜色
                                    },
                                    label: {
                                        // 控制指定位置出现的字体样式
                                        color: "#000", // 字体颜色
                                    }
                                }

                            }
                        ]
                    };
                    chinamap.setOption(mapoption);

                    window.addEventListener("resize", function () {
                        chinamap.resize();
                    });
                })();
            }
            else if (this.id === 'radio-2-5') {//农用塑料薄膜使用量
                yearElement.textContent = 2018;
                myChart.dispose();
                myChart = echarts.init(document.getElementById('chart1'));
                chinamap.dispose();
                chinamap = echarts.init(document.querySelector(".mainbox .map .china"));
                (function () {
                    var timeLineData = [2018, 2019, 2020, 2021];

                    option = {
                        baseOption: {
                            grid: {
                                show: false,
                                left: '4%',
                                top: 60,
                                bottom: "10%", // 调整底部间距
                                containLabel: true,
                            },
                            timeline: {
                                show: true,
                                axisType: 'category',
                                tooltip: {
                                    show: true,
                                    formatter: function (params) {
                                        return params.name + '年数据统计';
                                    }
                                },
                                autoPlay: true,
                                currentIndex: 0,
                                playInterval: 1000,
                                label: {
                                    normal: {
                                        show: true,
                                        interval: 'auto',
                                        formatter: '{value}年',
                                    },
                                },
                                lineStyle: {
                                    color: '#2F4858',  // 线条颜色
                                },
                                itemStyle: {
                                    color: '#2F4858',  // 圆点颜色
                                    borderColor: '#fff',  // 圆点边框颜色
                                },
                                controlStyle: {
                                    show: true,
                                    itemSize: 15,
                                    itemGap: 5,
                                    normal: {
                                        color: '#2F4858',  // 控制按钮颜色
                                        borderColor: '#000000',  // 控制按钮边框颜色
                                    },
                                    emphasis: {
                                        color: '#678E8C',  // 高亮状态下的控制按钮颜色
                                        borderColor: '#678E8C',  // 高亮状态下的控制按钮边框颜色
                                    }
                                },
                                checkpointStyle: {
                                    color: '#2F4858',  // 播放过程中的节点颜色
                                    borderColor: '#fff',  // 播放过程中的节点边框颜色
                                },
                                progress: {
                                    lineStyle: {
                                        color: '#2F4858',  // 播放过程中的线条颜色
                                    },
                                    itemStyle: {
                                        color: '#2F4858',  // 播放过程中的圆点颜色
                                        borderColor: '#fff',  // 播放过程中的圆点边框颜色
                                    },
                                },
                                data: [],
                            },
                            legend: {
                                data: ['农用塑料薄膜使用量'],
                                top: 4,
                                right: '20%',
                                textStyle: {
                                    color: '#000',
                                },
                            },
                            tooltip: {
                                show: true,
                                trigger: 'axis',
                                formatter: '{b}<br/>{a}: {c}万吨',
                                axisPointer: {
                                    type: 'shadow',
                                }
                            },
                            yAxis: [
                                {
                                    type: 'value',
                                    max: 28,
                                    interval: 4,
                                    axisLine: {
                                        show: false,
                                    },
                                    axisTick: {
                                        show: false,
                                    },
                                    position: 'top',
                                    axisLabel: {
                                        show: true,
                                        textStyle: {
                                            color: '#B2B2B2',
                                            fontSize: 12,
                                        },
                                    },
                                    splitLine: {
                                        show: true,
                                        lineStyle: {
                                            color: '#1F2022',
                                            width: 1,
                                            type: 'solid',
                                        },
                                    },
                                }],
                            xAxis: [{
                                type: 'category',
                                position: 'right',
                                axisLine: {
                                    show: false
                                },
                                axisTick: {
                                    show: false
                                },
                                axisLabel: {
                                    show: true,
                                    margin: 8,
                                    textStyle: {
                                        color: '#9D9EA0',
                                        fontSize: 12,
                                    },
                                    formatter: function (value) {
                                        // 将标签文字拆分为单个字符，并用换行符拼接
                                        return value.split("").join("\n");
                                    }
                                },
                                data: bomo_p,
                            }],
                            series: [],
                        },

                        options: [],
                    };

                    for (var i = 0; i < timeLineData.length; i++) {
                        option.baseOption.timeline.data.push(timeLineData[i]);
                        option.options.push({
                            title: {
                                text: timeLineData[i] + '年农用塑料薄膜使用量',
                            },
                            series: [{
                                name: '农用塑料薄膜使用量',
                                type: 'bar',
                                barGap: 20,
                                barWidth: 10,
                                label: {
                                    show: false
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#659F8380',
                                    },
                                    emphasis: {
                                        color: '#659F83',
                                    },
                                },
                                data: bomo[timeLineData[i]],
                            }]
                        });
                    }

                    //当时间改变
                    myChart.on('timelinechanged', function (params) {
                        var currentIndex = params.currentIndex;
                        var currentYear = myChart.getOption().timeline[0].data[currentIndex];
                        //更改标题
                        setTimeout(function () {
                            yearElement.textContent = currentYear;
                            mapoption.series = [
                                {
                                    type: "map",
                                    map: "china",
                                    selectedMode: false,
                                    data: generateMapData(bomo_p, bomo, currentYear),
                                    itemStyle: {
                                        // 修改地图区域的样式
                                        areaColor: "#f4f4f4", // 主体地图颜色
                                        borderColor: "#999", // 边框颜色
                                        borderWidth: 1, // 边框宽度
                                    },
                                    emphasis: {
                                        // 高亮状态下的样式
                                        itemStyle: {
                                            areaColor: "#ccc" // 高亮时的主体地图颜色
                                        },
                                        label: {
                                            // 控制指定位置出现的字体样式
                                            color: "#000", // 字体颜色
                                        }
                                    }

                                }
                            ]
                            chinamap.setOption(mapoption);
                        }, 150);
                    });

                    myChart.setOption(option);

                    window.addEventListener("resize", function () {
                        myChart.resize();
                    });
                })();
                (function () {
                    mapoption = {
                        visualMap: {
                            show: true,
                            type: 'continuous',
                            min: 0,
                            max: maxData(bomo, 2018),
                            color: ['#EEE8A9', '#26697C'],
                            right: "17%",
                            bottom: "30%"
                        },
                        tooltip: {
                            trigger: 'item', // 触发类型，'item' 表示数据项图形触发
                            formatter: function (params) {
                                // 自定义显示内容
                                // params.name 是地图区域名称，params.value 是对应的数据值
                                return `${params.name}农用塑料薄膜使用量: ${params.value}万吨`;
                            }
                        },
                        series: [
                            {
                                type: "map",
                                map: "china",
                                selectedMode: false,
                                data: generateMapData(bomo_p, bomo, 2018),
                                itemStyle: {
                                    // 修改地图区域的样式
                                    areaColor: "#f4f4f4", // 主体地图颜色
                                    borderColor: "#999", // 边框颜色
                                    borderWidth: 1, // 边框宽度
                                },
                                emphasis: {
                                    // 高亮状态下的样式
                                    itemStyle: {
                                        areaColor: "#ccc" // 高亮时的主体地图颜色
                                    },
                                    label: {
                                        // 控制指定位置出现的字体样式
                                        color: "#000", // 字体颜色
                                    }
                                }

                            }
                        ]
                    };
                    chinamap.setOption(mapoption);

                    window.addEventListener("resize", function () {
                        chinamap.resize();
                    });
                })();
            }
            else if (this.id === 'radio-2-6') {//有效灌溉面积
                yearElement.textContent = 2018;
                myChart.dispose();
                myChart = echarts.init(document.getElementById('chart1'));
                chinamap.dispose();
                chinamap = echarts.init(document.querySelector(".mainbox .map .china"));
                (function () {
                    var timeLineData = [2018, 2019, 2020, 2021, 2022];

                    option = {
                        baseOption: {
                            grid: {
                                show: false,
                                left: '4%',
                                top: 60,
                                bottom: "10%", // 调整底部间距
                                containLabel: true,
                            },
                            timeline: {
                                show: true,
                                axisType: 'category',
                                tooltip: {
                                    show: true,
                                    formatter: function (params) {
                                        return params.name + '年数据统计';
                                    }
                                },
                                autoPlay: true,
                                currentIndex: 0,
                                playInterval: 1000,
                                label: {
                                    normal: {
                                        show: true,
                                        interval: 'auto',
                                        formatter: '{value}年',
                                    },
                                },
                                lineStyle: {
                                    color: '#2F4858',  // 线条颜色
                                },
                                itemStyle: {
                                    color: '#2F4858',  // 圆点颜色
                                    borderColor: '#fff',  // 圆点边框颜色
                                },
                                controlStyle: {
                                    show: true,
                                    itemSize: 15,
                                    itemGap: 5,
                                    normal: {
                                        color: '#2F4858',  // 控制按钮颜色
                                        borderColor: '#000000',  // 控制按钮边框颜色
                                    },
                                    emphasis: {
                                        color: '#678E8C',  // 高亮状态下的控制按钮颜色
                                        borderColor: '#678E8C',  // 高亮状态下的控制按钮边框颜色
                                    }
                                },
                                checkpointStyle: {
                                    color: '#2F4858',  // 播放过程中的节点颜色
                                    borderColor: '#fff',  // 播放过程中的节点边框颜色
                                },
                                progress: {
                                    lineStyle: {
                                        color: '#2F4858',  // 播放过程中的线条颜色
                                    },
                                    itemStyle: {
                                        color: '#2F4858',  // 播放过程中的圆点颜色
                                        borderColor: '#fff',  // 播放过程中的圆点边框颜色
                                    },
                                },
                                data: [],
                            },
                            legend: {
                                data: ['有效灌溉面积'],
                                top: 4,
                                right: '20%',
                                textStyle: {
                                    color: '#000',
                                },
                            },
                            tooltip: {
                                show: true,
                                trigger: 'axis',
                                formatter: '{b}<br/>{a}: {c}千公顷',
                                axisPointer: {
                                    type: 'shadow',
                                }
                            },
                            yAxis: [
                                {
                                    type: 'value',
                                    max: 7000,
                                    interval: 1000,
                                    axisLine: {
                                        show: false,
                                    },
                                    axisTick: {
                                        show: false,
                                    },
                                    position: 'top',
                                    axisLabel: {
                                        show: true,
                                        textStyle: {
                                            color: '#B2B2B2',
                                            fontSize: 12,
                                        },
                                    },
                                    splitLine: {
                                        show: true,
                                        lineStyle: {
                                            color: '#1F2022',
                                            width: 1,
                                            type: 'solid',
                                        },
                                    },
                                }],
                            xAxis: [{
                                type: 'category',
                                position: 'right',
                                axisLine: {
                                    show: false
                                },
                                axisTick: {
                                    show: false
                                },
                                axisLabel: {
                                    show: true,
                                    margin: 8,
                                    textStyle: {
                                        color: '#9D9EA0',
                                        fontSize: 12,
                                    },
                                    formatter: function (value) {
                                        // 将标签文字拆分为单个字符，并用换行符拼接
                                        return value.split("").join("\n");
                                    }
                                },
                                data: guangai_p,
                            }],
                            series: [],
                        },

                        options: [],
                    };

                    for (var i = 0; i < timeLineData.length; i++) {
                        option.baseOption.timeline.data.push(timeLineData[i]);
                        option.options.push({
                            title: {
                                text: timeLineData[i] + '年有效灌溉面积',
                            },
                            series: [{
                                name: '有效灌溉面积',
                                type: 'bar',
                                barGap: 20,
                                barWidth: 10,
                                label: {
                                    show: false
                                },
                                itemStyle: {
                                    normal: {
                                        color: '#659F8380',
                                    },
                                    emphasis: {
                                        color: '#659F83',
                                    },
                                },
                                data: guangai[timeLineData[i]],
                            }]
                        });
                    }

                    //当时间改变
                    myChart.on('timelinechanged', function (params) {
                        var currentIndex = params.currentIndex;
                        var currentYear = myChart.getOption().timeline[0].data[currentIndex];
                        //更改标题
                        setTimeout(function () {
                            yearElement.textContent = currentYear;
                            mapoption.series = [
                                {
                                    type: "map",
                                    map: "china",
                                    selectedMode: false,
                                    data: generateMapData(guangai_p, guangai, currentYear),
                                    itemStyle: {
                                        // 修改地图区域的样式
                                        areaColor: "#f4f4f4", // 主体地图颜色
                                        borderColor: "#999", // 边框颜色
                                        borderWidth: 1, // 边框宽度
                                    },
                                    emphasis: {
                                        // 高亮状态下的样式
                                        itemStyle: {
                                            areaColor: "#ccc" // 高亮时的主体地图颜色
                                        },
                                        label: {
                                            // 控制指定位置出现的字体样式
                                            color: "#000", // 字体颜色
                                        }
                                    }

                                }
                            ]
                            chinamap.setOption(mapoption);
                        }, 150);

                    });

                    myChart.setOption(option);

                    window.addEventListener("resize", function () {
                        myChart.resize();
                    });
                })();
                (function () {
                    mapoption = {
                        visualMap: {
                            show: true,
                            type: 'continuous',
                            min: 0,
                            max: maxData(guangai, 2022),
                            color: ['#EEE8A9', '#26697C'],
                            right: "17%",
                            bottom: "30%"
                        },
                        tooltip: {
                            trigger: 'item', // 触发类型，'item' 表示数据项图形触发
                            formatter: function (params) {
                                // 自定义显示内容
                                // params.name 是地图区域名称，params.value 是对应的数据值
                                return `${params.name}有效灌溉面积: ${params.value}千公顷`;
                            }
                        },
                        series: [
                            {
                                type: "map",
                                map: "china",
                                selectedMode: false,
                                data: generateMapData(guangai_p, guangai, 2018),
                                itemStyle: {
                                    // 修改地图区域的样式
                                    areaColor: "#f4f4f4", // 主体地图颜色
                                    borderColor: "#999", // 边框颜色
                                    borderWidth: 1, // 边框宽度
                                },
                                emphasis: {
                                    // 高亮状态下的样式
                                    itemStyle: {
                                        areaColor: "#ccc" // 高亮时的主体地图颜色
                                    },
                                    label: {
                                        // 控制指定位置出现的字体样式
                                        color: "#000", // 字体颜色
                                    }
                                }

                            }
                        ]
                    };
                    chinamap.setOption(mapoption);

                    window.addEventListener("resize", function () {
                        chinamap.resize();
                    });
                })();
            }
        });
    });
});
